recharge/templates/payloads/Recharge.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ars="http://www.huawei.com/bme/cbsinterface/arservices" xmlns:cbs="http://www.huawei.com/bme/cbsinterface/cbscommon" xmlns:arc="http://cbs.huawei.com/ar/wsservice/arcommon">
   <soapenv:Header/>
   <soapenv:Body>
      <ars:RechargeRequestMsg>
         <RequestHeader>
            <cbs:Version>1</cbs:Version>
            <cbs:BusinessCode>?</cbs:BusinessCode>
            <cbs:MessageSeq>{{datetime}}</cbs:MessageSeq>
            <cbs:AccessSecurity>
               <cbs:LoginSystemCode>102</cbs:LoginSystemCode>
               <cbs:Password>7/PuyYwNpRtSX7jDpxnl2ECAvuVYH2Mu9zxqgPGJrPYYK73MCZN7DvrDepA=</cbs:Password>
            </cbs:AccessSecurity>
            <cbs:OperatorInfo>
               <cbs:OperatorID>101</cbs:OperatorID>
            </cbs:OperatorInfo>
         </RequestHeader>
         <RechargeRequest>
            <ars:RechargeObj>
               <ars:SubAccessCode>
                  <arc:PrimaryIdentity>{{msisdn}}</arc:PrimaryIdentity>
               </ars:SubAccessCode>
            </ars:RechargeObj>
            <ars:RechargeInfo>
               <ars:CashPayment>
                  {% if paymentMethod is not none  %}<ars:PaymentMethod>{{paymentMethod}}</ars:PaymentMethod>{% endif %}
                  <ars:Amount>{{amount}}</ars:Amount>
                  {% if bankId is not none %}<ars:BankInfo>
                     <arc:BankCode>{{bankId}}</arc:BankCode>
                  </ars:BankInfo>{% endif %}
               </ars:CashPayment>
            </ars:RechargeInfo>
            {% if au is not none %} <ars:AdditionalProperty>
               <arc:Code>CN_AU</arc:Code>
               <arc:Value>{{au}}</arc:Value>
            </ars:AdditionalProperty>{% endif %}
            {% if paymentType is not none%}<ars:AdditionalProperty>
               <arc:Code>CN_CHARGE_TYPE</arc:Code>
               <arc:Value>{{paymentType}}</arc:Value>
            </ars:AdditionalProperty>{% endif %}
            {% if callerID is not none%}<ars:AdditionalProperty>
               <arc:Code>CN_CALLER_ID</arc:Code>
               <arc:Value>{{callerID}}</arc:Value>
            </ars:AdditionalProperty>{% endif %}
            {% if voucherType is not none%}<ars:AdditionalProperty>
               <arc:Code>CN_VC_TYPE</arc:Code>
               <arc:Value>{{voucherType}}</arc:Value>
            </ars:AdditionalProperty>{% endif %}
            {% if location is not none%}<ars:AdditionalProperty>
               <arc:Code>C_CELLID</arc:Code>
               <arc:Value>{{location}}</arc:Value>
            </ars:AdditionalProperty>{% endif %}
            {% if serialNumber is not none%}<ars:AdditionalProperty>
               <arc:Code>CN_VC_SN</arc:Code>
               <arc:Value>{{serialNumber}}</arc:Value>
            </ars:AdditionalProperty>{% endif %}
         </RechargeRequest>
      </ars:RechargeRequestMsg>
   </soapenv:Body>
</soapenv:Envelope>